Revit 2026 API

# ZoneCalculatedHeatingLoad Property

---

**Note: This API is now obsolete.**

Get the Calculated Heating Load of the Zone.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone and SystemZoneData objects instead.")]
public double CalculatedHeatingLoad { get; }
```
```vb
<ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone and SystemZoneData objects instead.")>
Public ReadOnly Property CalculatedHeatingLoad As Double
	Get
```
```cpp
public:
[ObsoleteAttribute(L"This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone and SystemZoneData objects instead.")]
property double CalculatedHeatingLoad {
	double get ();
}
```
```fsharp
[<ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone and SystemZoneData objects instead.")>]
member CalculatedHeatingLoad : float with get
```

#### Property Value

Double

This property is used to get the Calculated Heating Load of the Zone.

#### Reference

Zone Class

Autodesk.Revit.DB.Mechanical Namespace